experiments/cavityDye/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| Set an initial blob of dye (C=1 in a small region)
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}

defaultFieldValues
(
    volScalarFieldValue C 0
);

regions
(
    boxToCell
    {
        box (0.45 0.45 0) (0.55 0.55 0.1);   // small box in the middle (2D mesh: z thickness tiny)
        fieldValues
        (
            volScalarFieldValue C 1
        );
    }
);
